--- a/builder-pattern/Readme.md
+++ b/builder-pattern/Readme.md
@@ -39,23 +39,56 @@ classDiagram
 - OSごとに、実際にディレクトリを作成する実装が異なるので、これをサブクラスに分けてWindows用、MacOS用、と作る
     - 第３のOSが増えても、サブタイプを作ることで対応できる
 
-```mermaid
-classDiagram
-   Main --> JavaTool
-   JavaTool *-- FileCreator
-   FileCreator <|.. WindowsFileCreator
-   FileCreator <|.. MacFileCreator
-   
-   note for JavaTool "create java standard directory structure"
-   
-   class JavaTool {
-       -fileCreator FileCreator
-       +createJavaStandardDirectory() void 
-   }
-   class FileCreator {
-       <<interface>>
-       +createDirectory() void
-       +createFile() void
-   }
-   
+```plantuml
+@startuml
+    class JavaTool {
+        FileCreator fileCreator 
+        void createJavaStandardDirectory()
+    }
+    interface FileCreator {
+        void createDirectory()
+        void createFile()
+    }
+
+    class Main
+    class WindowsFileCreator
+    class MacFileCreator
+    
+    Main --> JavaTool
+    JavaTool *- FileCreator
+    FileCreator <|.. WindowsFileCreator
+    FileCreator <|.. MacFileCreator
+    
+    note left of JavaTool : "create java standard\ndirectory structure"
+@enduml
+```
+
+## あるいは
+
@@
 ```
